#  Создать список, содержащий цены на товары (10–20 товаров), например:
# [57.8, 46.51, 97, ...]
# Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде <r> руб <kk> коп
#  (например «5 руб 04 коп»). Подумать, как из цены получить рубли и копейки, как добавить нули, если, например,
#  получилось 7 копеек или 0 копеек (должно быть 07 коп или 00 коп).
# Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что объект списка после сортировки остался тот же).
# Создать новый список, содержащий те же цены, но отсортированные по убыванию.
# Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?

price_list = [57.8, 46.51, 97, 120, 99.50, 200.05, 19.99, 80, 250.50, 10.80]
new_list = []
for i in price_list:
    b = i * 100
    a = b // 100
    m = b % 100
    new_list.append(f'{int(a):02d} руб {int(m):02d} коп')
print(new_list)


print(id(price_list))
price_list.sort()
print(price_list)
print(id(price_list))

my_list = price_list
price_list.sort(reverse=True)
print(my_list)

print(sorted(my_list)[-5:])
