# *(вместо задачи 3) Написать функцию thesaurus_adv(), принимающую в качестве аргументов строки в формате «Имя Фамилия» и
# возвращающую словарь, в котором ключи — первые буквы фамилий, а значения — словари, реализованные по схеме предыдущего
# задания и содержащие записи, в которых фамилия начинается с соответствующей буквы. Например:
# >>> thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева")
# {
#     "А": {
#         "П": ["Петр Алексеев"]
#     },
#     "И": {
#         "И": ["Илья Иванов"]
#     },
#     "С": {
#         "И": ["Иван Сергеев", "Инна Серова"],
#         "А": ["Анна Савельева"]
#     }
# }


def thesaurus_adv(*names):
    name_dict = {}
    for el in sorted(names):  # Сортируем по алфавиту
        name_surname = el.split()
        name_first_letter = name_surname[0][0]
        surname_first_letter = name_surname[1][0]
        name_dict.setdefault(surname_first_letter, {})
        name_dict[surname_first_letter].setdefault(name_first_letter, []).append(el)
    return dict(sorted(name_dict.items(), key=lambda x: x[0]))  # Возвращаем отсортированный по ключам словарь


print(thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева"))
